ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/CBASS_INFRA1_QOS.xml
<module name="CBASS_INFRA1_QOS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="QOS_REGS_Ipulsar_lite_main_0_cpu0_pmst_map0" acronym="QOS_REGS_Ipulsar_lite_main_0_cpu0_pmst_map0" offset="0x100" width="32" description="The Map Register defines the fields for the master Ipulsar_lite_main_0.cpu0_pmst per channel.">
		<bitfield id="EPRIORITY" width="3" begin="14" end="12" resetval="0x7" description="epriority signal for channel N." range="14 - 12" rwaccess="R/W"/> 
		<bitfield id="ASEL" width="4" begin="11" end="8" resetval="0x0" description="asel signal for channel N. 0 = SOC address. 1-15 = peripheral address." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="ORDERID" width="4" begin="7" end="4" resetval="0x0" description="orderid signal for channel N." range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="QOS" width="3" begin="2" end="0" resetval="0x0" description="qos signal for channel N." range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="QOS_REGS_Ipulsar_lite_main_0_cpu1_pmst_map0" acronym="QOS_REGS_Ipulsar_lite_main_0_cpu1_pmst_map0" offset="0x500" width="32" description="The Map Register defines the fields for the master Ipulsar_lite_main_0.cpu1_pmst per channel.">
		<bitfield id="EPRIORITY" width="3" begin="14" end="12" resetval="0x7" description="epriority signal for channel N." range="14 - 12" rwaccess="R/W"/> 
		<bitfield id="ASEL" width="4" begin="11" end="8" resetval="0x0" description="asel signal for channel N. 0 = SOC address. 1-15 = peripheral address." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="ORDERID" width="4" begin="7" end="4" resetval="0x0" description="orderid signal for channel N." range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="QOS" width="3" begin="2" end="0" resetval="0x0" description="qos signal for channel N." range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="QOS_REGS_Ipulsar_lite_main_1_cpu0_pmst_map0" acronym="QOS_REGS_Ipulsar_lite_main_1_cpu0_pmst_map0" offset="0x900" width="32" description="The Map Register defines the fields for the master Ipulsar_lite_main_1.cpu0_pmst per channel.">
		<bitfield id="EPRIORITY" width="3" begin="14" end="12" resetval="0x7" description="epriority signal for channel N." range="14 - 12" rwaccess="R/W"/> 
		<bitfield id="ASEL" width="4" begin="11" end="8" resetval="0x0" description="asel signal for channel N. 0 = SOC address. 1-15 = peripheral address." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="ORDERID" width="4" begin="7" end="4" resetval="0x0" description="orderid signal for channel N." range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="QOS" width="3" begin="2" end="0" resetval="0x0" description="qos signal for channel N." range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="QOS_REGS_Ipulsar_lite_main_1_cpu1_pmst_map0" acronym="QOS_REGS_Ipulsar_lite_main_1_cpu1_pmst_map0" offset="0xD00" width="32" description="The Map Register defines the fields for the master Ipulsar_lite_main_1.cpu1_pmst per channel.">
		<bitfield id="EPRIORITY" width="3" begin="14" end="12" resetval="0x7" description="epriority signal for channel N." range="14 - 12" rwaccess="R/W"/> 
		<bitfield id="ASEL" width="4" begin="11" end="8" resetval="0x0" description="asel signal for channel N. 0 = SOC address. 1-15 = peripheral address." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="ORDERID" width="4" begin="7" end="4" resetval="0x0" description="orderid signal for channel N." range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="QOS" width="3" begin="2" end="0" resetval="0x0" description="qos signal for channel N." range="2 - 0" rwaccess="R/W"/>
	</register>
</module>